app/controllers/api/v1/greetings_controller.rb

SELECT "greetings".* FROM "greetings"
SELECT "greetings".* FROM "greetings" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]
---
  def index
    # @greetings = Greeting.all

    # render json: @greetings
    render json: [{
      message: Greeting.order(Arel.sql('RANDOM()')).first.message

    }].to_json